package array

// 请你判断一个 9 x 9 的数独是否有效。只需要 根据以下规则 ，验证已经填入的数字是否有效即可。
//
// 数字 1-9 在每一行只能出现一次。
// 数字 1-9 在每一列只能出现一次。
// 数字 1-9 在每一个以粗实线分隔的 3x3 宫内只能出现一次。（请参考示例图）
//
// 注意：
//
// 一个有效的数独（部分已被填充）不一定是可解的。
// 只需要根据以上规则，验证已经填入的数字是否有效即可。
// 空白格用 '.' 表示。
//
// 示例 1：
//
// 输入：board =
// [["5","3",".",".","7",".",".",".","."]
// ,["6",".",".","1","9","5",".",".","."]
// ,[".","9","8",".",".",".",".","6","."]
// ,["8",".",".",".","6",".",".",".","3"]
// ,["4",".",".","8",".","3",".",".","1"]
// ,["7",".",".",".","2",".",".",".","6"]
// ,[".","6",".",".",".",".","2","8","."]
// ,[".",".",".","4","1","9",".",".","5"]
// ,[".",".",".",".","8",".",".","7","9"]]
// 输出：true
//
// 示例 2：
//
// 输入：board =
// [["8","3",".",".","7",".",".",".","."]
// ,["6",".",".","1","9","5",".",".","."]
// ,[".","9","8",".",".",".",".","6","."]
// ,["8",".",".",".","6",".",".",".","3"]
// ,["4",".",".","8",".","3",".",".","1"]
// ,["7",".",".",".","2",".",".",".","6"]
// ,[".","6",".",".",".",".","2","8","."]
// ,[".",".",".","4","1","9",".",".","5"]
// ,[".",".",".",".","8",".",".","7","9"]]
// 输出：false
// 解释：除了第一行的第一个数字从 5 改为 8 以外，空格内其他数字均与 示例1 相同。 但由于位于左上角的 3x3 宫内有两个 8 存在, 因此这个数独是无
// 效的。
//
// 提示：
//
// board.length == 9
// board[i].length == 9
// board[i][j] 是一位数字（1-9）或者 '.'
func isValidSudoku(board [][]byte) bool {
	rowUsed, colUsed, boxUsed := [9][9]bool{}, [9][9]bool{}, [9][9]bool{}
	for row, cols := range board {
		for col, num := range cols {
			if num == '.' {
				continue
			}
			index := num - '0' - 1
			box := (row/3)*3 + col/3
			if rowUsed[row][index] || colUsed[col][index] || boxUsed[box][index] {
				return false
			}
			rowUsed[row][index], colUsed[col][index], boxUsed[box][index] = true, true, true
		}
	}
	return true
}

/**
思路1：暴力解法
遍历每行、每列、每宫，判断是否有重复字符。

思路2：备忘录
一边遍历，一边判断，一边记录。
空间压缩：
	- [9][9]bool{}：用 bool 数组代替哈希表，且为了不浪费索引 0 的空间，需要将数字 1-9 转换为 0-8。
	  num - '.' - 1：先转为数字，再转为数组索引。
	- 宫定位：(row/3)*3 + col/3
		- row/3：以宫划分的行，[0, 2]
		- (row/3)*3：以宫划分的从左到右横向计数，从第 0 行到第 row/3 行一共有多少个宫 - 1
		- col/3：以宫划分的列，[0, 2]
*/
